import css from './style.module.css';

const PrivacyContent = () => {
  return (
    <div className={[css.container, css.noneScroll].join(' ')}>
      <div className={css.heading}>
        <p className={css.updatedDate}>Шинэчлэгдсэн огноо: 2024.08.12</p>

        <p className={css.decs}>
          Нууцлалын бодлогоор Дижитал Финекс ХХК (цаашид “Компани” гэх)-иас
          timex.mn (цаашид “Платформ” гэх)-д Хэрэглэгч /цаашид “Хэрэглэгч” эсхүл
          “Та” гэх/-ийн хувийн мэдээллийг цуглуулах, боловсруулах, ашиглах,
          дамжуулах, хамгаалахтай холбоотой харилцааг зохицуулна.
        </p>
      </div>

      <ol className={css.list}>
        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Ерөнхий нөхцөл</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Компани нь Хэрэглэгч платформд бүртгүүлэх, ашиглах үед Хүний
              хувийн мэдээлэл хамгаалах тухай хуульд заасан нөхцөл, журам болон
              энэхүү Нууцлалын бодлогод зааснаар Таны хувийн мэдээллийг
              цуглуулж, боловсруулж, хадгалж, ашиглах бөгөөд мэдээллийн аюулгүй
              байдлыг хангана.
            </li>
            <li className={css.list_item}>
              Хэрэглэгч платформд бүртгүүлэхээс өмнө энэхүү Нууцлалын бодлоготой
              бүрэн танилцах үүрэгтэй.
            </li>
            <li className={css.list_item}>
              Хэрэглэгч платформыг хэрэглэж байгаа бол өөрийн хувийн мэдээллийг
              цуглуулж, боловсруулж, хадгалж, ашиглах цахим зөвшөөрлийг Компанид
              олгосонд тооцно.
            </li>

            <li className={css.list_item}>
              Нууцлалын бодлогод заасан дараах нэр томьёог дор дурдсан утгаар
              ойлгоно.
              <ol className={css.list}>
                <li className={css.list_item}>
                  <b>“Мэдээлэл цуглуулах”</b> гэж мэдээллийг олж авах,
                  бүрдүүлэх, бүртгүүлэх үйл ажиллагааг;
                </li>
                <li className={css.list_item}>
                  <b>“Мэдээлэл боловсруулах”</b> гэж мэдээллийг ангилах,
                  хадгалах, дүн шинжилгээ хийх, Хэрэглэгчийн хүсэлтээр өөрчлөх,
                  устгах, сэргээх үйл ажиллагааг;
                </li>
                <li className={css.list_item}>
                  <b>“Мэдээлэл ашиглах”</b> гэж үйл ажиллагаанд хэрэглэх,
                  дамжуулах болон мэдээлэлтэй танилцах үйл ажиллагааг;
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Нууцлалын бодлогоор зохицуулаагүй харилцааг Монгол Улсын Хүний
              хувийн мэдээлэл хамгаалах тухай хуулиар зохицуулна.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Компанийн баримтлах зарчим</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Компани нь Хэрэглэгчээс олгосон цахим зөвшөөрлийг үндэслэн
              мэдээллийг цуглуулж, боловсруулж, ашиглана.
            </li>
            <li className={css.list_item}>
              Компани Хэрэглэгчийн мэдээллийг цуглуулж, боловсруулах, ашиглах
              ажиллагаанд Таны мэдээллийн үнэн зөв, бүрэн бүтэн байдлыг
              алдагдуулахгүй байх, мэдээллийн аюулгүй байдлыг хангах зарчмуудыг
              баримтална.
            </li>
            <li className={css.list_item}>
              Хэрэглэгч өөрт хамааралтай мэдээллийн үнэн зөв байдлыг хариуцах
              бөгөөд мэдээллийг дутуу эсхүл зөрүүтэй оруулснаас үүдэх эрх зүйн
              үр дагаврыг бие даан өөрөө хариуцна.
            </li>
            <li className={css.list_item}>
              Хэрэглэгч нь хувийн мэдээлэл цуглуулах, боловсруулах, ашиглах
              цахим зөвшөөрлийг цуцалснаас хойш түүний мэдээллийг
              боловсруулахгүй, ашиглахгүй, цаашид дахин цуглуулахгүй.
            </li>
            <li className={css.list_item}>
              Компани өөрсдийн туршлага болон хууль тогтоомжид нийцүүлэн энэхүү
              Нууцлалын бодлогод ямар ч үед нэмэлт өөрчлөлт оруулах эрхтэй
              бөгөөд шинэчлэгдсэн Нууцлалын бодлогыг тухай бүр цахим хуудсанд
              байршуулна.
            </li>
            <li className={css.list_item}>
              Компани Нууцлалын бодлогод тусгаснаас өөрөөр болон Монгол улсын
              хуульд зааснаас бусад ямар ч тохиолдолд хэрэглэгчийн аливаа
              мэдээллийг гуравдагч этгээдэд дамжуулахгүй.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>
            Хэрэглэгчийн мэдээллийг цуглуулах, боловсруулах, ашиглах нөхцөл,
            хугацаа
          </b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Компани нь Хэрэглэгчийн зөвшөөрөлгүйгээр дор дурдсан нөхцөлөөс
              бусад зорилгоор Хэрэглэгчийн мэдээллийг цуглуулахгүй,
              боловсруулахгүй, ашиглахгүй болно. Үүнд:
              <ol className={css.list}>
                <li className={css.list_item}>Платформын үйлчилгээ үзүүлэх;</li>
                <li className={css.list_item}>
                  Платформын төлбөр тооцоог гүйцэтгэгч гуравдагч байгууллагын
                  үйлчилгээг авах зорилгоор;
                </li>
                <li className={css.list_item}>
                  Платформ дахь Таны бүртгэлийг удирдах, техникийн мэдэгдэл,
                  шинэчлэлт, аюулгүй байдлын анхааруулга, дэмжлэг болон
                  удирдлагын мэдээ илгээх;
                </li>
                <li className={css.list_item}>
                  Таны гомдол, санал, хүсэлтийг хүлээн авах, шийдвэрлэх,
                  техникийн асуудлуудыг шийдэх;
                </li>
                <li className={css.list_item}>
                  Хориотой байж болзошгүй эсвэл Хууль бус үйл ажиллагаанаас
                  урьдчилан сэргийлэх;
                </li>
                <li className={css.list_item}>
                  Платформыг хэрэглэгчийн хэрэгцээнд тохируулан өөрчлөх, хэмжих,
                  сайжруулах;
                </li>
                <li className={css.list_item}>
                  Компани болон гуравдагч байгууллагаас мессеж, и-мэйлээр
                  маркетингийн болон сурталчилгааны мэдээлэл явуулах;
                </li>
                <li className={css.list_item}>
                  Компани timex.mn-ийн программ хангамжийг хөгжүүлэх, мэдээлэл
                  технологийн шинэ шийдэлд тулгуурласан энгийн, хялбар,
                  хэрэглээг бий болгох, хууль бус хандалтаас урьдчилан
                  сэргийлэх;
                </li>
              </ol>
            </li>
            <li className={css.list_item}>
              Компани Хэрэглэгчийг платформд бүртгүүлснээс эхлээд бүртгэлийг
              хаах хүртэл хугацаанд мэдээллийг цуглуулж, боловсруулж, ашиглана.
            </li>
            <li className={css.list_item}>
              Компани Хэрэглэгчийн дараах мэдээллийг доорх тохиолдолд гуравдагч
              этгээдэд дамжуулж болно. Үүнд:
              <ol className={css.list}>
                <li className={css.list_item}>
                  Платформын үйлчилгээг үзүүлэх зорилгоор Таны үйл ажиллагааны
                  чиглэл, үйлчилгээний төрөл, ажилтнуудын мэдээлэл, үйлчилгээний
                  үнэ, цагийн хуваарь, цаг захиалгын мэдээлэл, холбоо барих
                  мэдээллийг;
                </li>
                <li className={css.list_item}>
                  Платформоор дамжуулсан Хэрэглэгчийн төлбөр тооцоог гүйцэтгэх
                  гуравдагч байгууллагын үйлчилгээг авах зорилгоор Таны банкны
                  дансны мэдээлэл, гүйлгээний дүнг;
                </li>
                <li className={css.list_item}>
                  Мессеж, и-мэйл илгээх зорилгоор Таны холбоо барих мэдээллийг;
                </li>
                <li className={css.list_item}>
                  Маркетинг сурталчилгааны консалтинг үйлчилгээ үзүүлэгч
                  байгууллагын үйлчилгээг авах зорилгоор Таны цаг захиалгын
                  мэдээллийг;
                </li>
              </ol>
            </li>
            <li className={css.list_item}>
              Хэрэглэгчийн мэдээллийг шаардлагатай хугацааны туршид хадгалах
              бөгөөд мэдээллийг хэдий хугацаанд боловсруулж, хадгалахыг
              тодорхойлохын тулд мэдээллийн хэмжээ, шинж чанар болон эмзэг
              байдал, мэдээллийг задруулах, зөвшөөрөлгүй халдах үед үүсэж болох
              боломжит эрсдэл, Компанийн боловсруулах мэдээллийн зорилго,
              холбогдох хуулийн шаардлага, болон Компанийн хууль ёсны ашиг
              сонирхол зэргийг харгалзан Монгол Улсын Засгийн газраас баталсан
              кибер аюулгүй байдлын нийтлэг журам, Хүний хувийн мэдээлэл
              хамгаалах хуульд заасан хугацаагаар эсхүл түүнээс илүү хугацаагаар
              хадгална.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>
            Цуглуулж, боловсруулж ашиглах мэдээллийн жагсаалт
          </b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Компани платформын үйл ажиллагааг явуулах, тасралтгүй, найдвартай,
              хэвийн ажиллагааг хангах, платформын программ хангамжийг
              хөгжүүлэх, мэдээлэл технологийн шинэ шийдэлд тулгуурласан энгийн,
              хялбар, хэрэглээг бий болгох, хууль бус хандалтаас урьдчилан
              сэргийлэх зорилгоор Хэрэглэгчийн мэдээллийг цуглуулж, боловсруулж
              ашиглана.
              <ol className={css.list}>
                <li className={css.list_item}>
                  Танаас дараах төрлийн мэдээллийг авч болно. Үүнд:
                  <ul>
                    <li>
                      Овог нэр/Хуулийн этгээдийн нэр, регистрийн дугаар зэрэг
                      таныг тодорхойлох мэдээлэл;
                    </li>
                    <li>
                      Утасны дугаар, и-мэйл хаяг зэрэг холбоо барих мэдээлэл;
                    </li>
                    <li>Банкны дансны дугаар зэрэг санхүүгийн мэдээлэл;</li>
                    <li>Хаяг байршлын мэдээлэл;</li>
                    <li>
                      Иргэний үнэмлэх/улсын бүртгэлийн гэрчилгээ зэрэг баримт
                      бичгийн мэдээлэл;
                    </li>
                    <li>
                      Үйл ажиллагааны төрөл, ажилтнууд, цагийн хуваарь,
                      үйлчилгээний нэр төрөл үнэ зэрэг таны бизнест хамаарах
                      мэдээллүүд;
                    </li>
                    <li>Хэрэглэгчийн эрүүл мэндийн зарим мэдээллийг;</li>
                  </ul>
                </li>
                <li className={css.list_item}>
                  Таныг Платформд нэвтрэх, ашиглах үед бид дараах мэдээллийг
                  автоматаар цуглуулна. Үүнд:
                  <ul>
                    <li>Платформд нэвтэрсэн, гарсан, ашиглалт, хугацаа;</li>
                    <li>
                      Платформыг ашиглах явцад үүсэж буй бүртгэлийн болон бусад
                      цахим өгөгдлүүд;
                    </li>
                    <li>
                      Байршлын мэдээлэл: Танаас урьдчилан зөвшөөрөл авсны дагуу
                      платформд хандах буюу ашиглах үед бид таны төхөөрөмжөөс
                      байршлын мэдээллийг авч болно.
                    </li>
                    <li>
                      Хэрэглэгчийн хүсэлт, санал, гомдол, түүнийг шийдвэрлэх
                      явц, үр дүнгийн талаарх мэдээллүүд;
                    </li>
                    <li>Платформ дээр хийсэн хайлтын мэдээллүүд;</li>
                    <li>
                      Хэрэглэгчийн IP хаягийн мэдээлэл, веб хөтөч, ашиглаж буй
                      үйлдлийн систем, нэвтэрсэн хугацаа;
                    </li>
                  </ul>
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>
            Хэрэглэгчийн хувийн халдашгүй байх эрхийн хамгаалалт
          </b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Хэрэглэгч хувийн мэдээллээ өөрөө өөрчлөх, засварлах боломжтой.
              <ol className={css.list}>
                <li className={css.list_item}>
                  Хэрэглэгч хувийн халдашгүй байх эрхээ хэрэгжүүлэх хүрээнд
                  Компанид олгосон мэдээлэл цуглуулах, боловсруулах, ашиглуулах
                  зөвшөөрлөө хэдийд ч цуцлах эрхтэй бөгөөд энэ хүсэлтийг Компани
                  хүлээж авснаас хойш Хэрэглэгчийн мэдээллийг цаашид
                  цуглуулахгүй.
                </li>
                <li className={css.list_item}>
                  Хэрэглэгч платформд бүртгүүлэхдээ платформоос шаардсан нууц
                  үгийн бодлогын дагуу хүчтэй нууц үг оруулах үүрэгтэй.
                  Хангалттай хүчтэй нууц үг үүсгээгүй, нэвтрэх мэдээллээ бусдад
                  алдсанаас болж үүссэн аливаа асуудалд Компани хариуцлага
                  хүлээхгүй.
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>
            Хэрэглэгчийн мэдээллийг ил болгох нөхцөл
          </b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Монгол улсын хуульд заасан тохиолдолд төрийн эрх бүхий
              байгууллагын шаардлагаар Хэрэглэгчийн мэдээллийг ил болгоно.
            </li>
            <li className={css.list_item}>
              Компани нь Платформын үйлчилгээг үзүүлэх зорилгоор Хэрэглэгчийн
              нэр, утасны дугаар, үйл ажиллагааны чиглэл, үйлчилгээний төрөл,
              үнэ, цагийн хуваарь зэрэг мэдээллийг ил болгож болно.
            </li>
            <li className={css.list_item}>
              Мэдээллийн хариуцагч нь Нууцлалын бодлогын 6.1, 6.2-д зааснаас
              бусад тохиолдолд Хэрэглэгчийн хувийн мэдээллийг ил болгохгүй.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Холбоо барих</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Та Нууцлалын бодлогод заасан нөхцөл, хэрэгжилттэй холбоотой
              хүсэлт, санал, гомдлоо info@timex.mn хаягаар цахимаар илгээж
              шийдвэрлүүлэх эрхтэй.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Бусад</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Нууцлалын бодлогын дээд хэсэгт байрлах огноо нь хамгийн сүүлд
              хэзээ шинэчлэгдсэнийг харуулна.
            </li>
            <li className={css.list_item}>
              Нууцлалын бодлогод оруулсан аливаа өөрчлөлт нь шинэчилсэн
              Нууцлалын бодлогыг нийтлэх үед хүчин төгөлдөр болно.
            </li>
            <li className={css.list_item}>
              Нууцлалын бодлогод нэмэлт, өөрчлөлт орсны дараа Үйлчилгээг
              үргэлжлүүлэн ашигласнаар та шинэчлэгдсэн Нууцлалын бодлогыг уншиж,
              ойлгосон болохоо хүлээн зөвшөөрч байна гэж үзнэ.
            </li>
          </ol>
        </li>
      </ol>
    </div>
  );
};

export default PrivacyContent;
