'use client';

import { useCallback, useEffect, useRef } from 'react';

import css from './style.module.css';

const TermsContent = ({ setTermsPer }) => {
  const scrollRef = useRef(null);

  const handleScroll = useCallback(() => {
    const div = scrollRef.current;
    const scrollTop = div.scrollTop;

    const scrollHeight = div.scrollHeight - div.clientHeight;
    const scrollPercent = (scrollTop / scrollHeight) * 100;

    setTermsPer && setTermsPer(scrollPercent);
  }, [setTermsPer]);

  useEffect(() => {
    const div = scrollRef.current;

    div.addEventListener('scroll', handleScroll);

    return () => {
      div.removeEventListener('scroll', handleScroll);
    };
  }, [handleScroll]);

  return (
    <div
      ref={scrollRef}
      className={[css.container, setTermsPer ? '' : css.noneScroll].join(' ')}
    >
      <div className={css.heading}>
        <p className={css.updatedDate}>Шинэчилсэн огноо: 2024.08.08</p>

        <p className={css.decs}>
          “Дижитал Финекс” ХХК-ийн TIMEX.MN цаг захиалгын Платформ-д тавтай
          морилно уу.
        </p>
      </div>

      <ol className={css.list}>
        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Ерөнхий нөхцөл</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Энэхүү Үйлчилгээний нөхцөл нь Дижитал Финекс ХХК (цаашид “Компани”
              гэх)-ийн хөгжүүлэн үйл ажиллагааг хариуцаж буй WWW.TIMEX.MN
              (цаашид “Платформ” гэх)-д Харилцагч бүртгэл үүсгэх, уг бүртгэлээр
              дамжин Платформд нэвтэрч багц идэвхжүүлэх, авсан багцад хамаарах
              үйлчилгээ авахтай холбогдох харилцааг зохицуулах үндсэн баримт
              бичиг болно.
            </li>
            <li className={css.list_item}>
              Харилцагч та (цаашид “Харилцагч” гэх) бүртгэл үүсгэхийн өмнө
              Компанийн Үйлчилгээний нөхцөл, Нууцлалын бодлого, Платформын
              танилцуулгатай заавал уншиж танилцах үүрэгтэй бөгөөд ийнхүү уншиж
              танилцсан тухай баталгаажуулах үйлдэл хийснээр Үйлчилгээний
              нөхцөлийг хүлээн зөвшөөрсөн гэж үзнэ.
            </li>
            <li className={css.list_item}>
              Хэрэв Харилцагч Үйлчилгээний нөхцөлийг хүлээн зөвшөөрөхгүй
              тохиолдолд Платформд бүртгүүлэх боломжгүй бөгөөд Танд бүртгэл
              үүсгэхгүй болохыг анхаарна уу.
            </li>
            <li className={css.list_item}>
              Компани нь Үйлчилгээний нөхцөлд хэдийд ч өөрчлөлт оруулах эрхтэй
              бөгөөд харилцагч Үйлчилгээний нөхцөлийн хамгийн сүүлийн хувилбарыг
              уншиж танилцаж байх үүрэгтэй ба танилцаагүйгээс үүсэх үр дагаврыг
              Харилцагч бүрэн хариуцна.
            </li>

            <li className={css.list_item}>
              Энэхүү Үйлчилгээний нөхцөлд хэрэглэсэн дараах нэр томьёог дор
              дурдсан утгаар ойлгоно. Үүнд:
              <ol className={css.list}>
                <li className={css.list_item}>
                  <b>“Платформ”</b> гэж Timex.mn цаг захиалгын Платформын
                  вэбсайт, аппликейшныг хамтад нь,
                </li>
                <li className={css.list_item}>
                  <b>“Платформын үйлчилгээ”</b> гэж Платформоор дамжуулан цаг
                  захиалга бүртгэх, урьдчилгаа төлбөрөөр захиалгыг
                  баталгаажуулах, төлбөр төлөх, тайлан мэдээлэл нэгтгэн харах,
                  татах зэрэг Компаниас Харилцагч, хэрэглэгчдэд үзүүлж буй
                  үйлчилгээг,
                </li>
                <li className={css.list_item}>
                  <b>“Компани”</b> гэж Платформыг өмчилж, эзэмшигч Дижитал
                  Финекс ХХК-ийг,
                </li>
                <li className={css.list_item}>
                  <b>“Харилцагч”</b> гэж энэхүү үйлчилгээний нөхцөлийг
                  зөвшөөрсний үндсэн дээр Платформын үйлчилгээг ашиглан өөрийн
                  үйлчилгээ, цаг захиалгыг санал болгож буй хувь хүн, хуулийн
                  этгээдийг,
                </li>
                <li className={css.list_item}>
                  <b>“Хэрэглэгч”</b> гэж тус Платформын Үйлчилгээний нөхцөлийг
                  хүлээн зөвшөөрч, цаг захиалгын үйлчилгээг авч буй хувь хүн,
                  хуулийн этгээдийг,
                </li>
                <li className={css.list_item}>
                  <b>“Цаг захиалга”</b> гэж Харилцагчийн Платформд бүртгэн санал
                  болгосон үйлчилгээг Хэрэглэгч авахаар сонгох, бусад сувгаар
                  ирсэн цаг захиалгыг Харилцагч Платформд бүртгэх үйл явцыг,
                </li>
                <li className={css.list_item}>
                  <b>“Урьдчилгаа төлбөр”</b> гэж цаг захиалгыг баталгаажуулахаар
                  Харилцагчийн тогтоосон үйлчилгээний төлбөрийн тодорхой хувь
                  хэмжээтэй тэнцэх мөнгөн дүнг ойлгоно.
                </li>
                <li className={css.list_item}>
                  <b>“Кю-Пэй 2.0 үйлчилгээ”</b> гэж байгууллага, хувь хүн нь
                  олон улсын EMVCo стандартын QR код уншуулах/унших замаар
                  картын болон дансны шилжүүлэг хийх, шилжүүлэг хүлээн авах
                  боломжийг олгох үйлчилгээг ойлгоно.
                </li>
                <li className={css.list_item}>
                  <b>“Үйлчилгээний багц”</b> гэж Компаниас Харилцагчид санал
                  болгож буй Платформын үйлчилгээг ялгаатай байдлаар
                  тохируулсан, ялгаатай үнэ бүхий үйлчилгээний багцыг,
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Мэдэгдэл баталгаа</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Компани нь дараах зүйлүүдийг мэдэгдэж, баталж байгаа бөгөөд
              Харилцагч нь Компанийн энэхүү мэдэгдэл болон баталгааны үндсэн
              дээр Платформын үйлчилгээг авч байгаа болно.
              <ol className={css.list}>
                <li className={css.list_item}>
                  Компани нь Монгол Улсын хуулийн дагуу үүсгэн байгуулагдаж
                  Монгол Улсын холбогдох хуулийн дагуу үйл ажиллагаа явуулдаг
                  хязгаарлагдмал хариуцлагатай компани болохыг;
                </li>
                <li className={css.list_item}>
                  Компани нь Харилцагчийн сонгосон багцын үйлчилгээг үзүүлэх
                  болохыг;
                </li>
                <li className={css.list_item}>
                  Компани нь Монгол Улсын холбогдох хууль тогтоомжид хориглоогүй
                  үйлчилгээг Харилцагчдад үзүүлж байгаа болохыг;
                </li>
                <li className={css.list_item}>
                  Компани нь олон улсад нийтлэг ашиглагддаг Монгол улсын
                  холбогдох эрх бүхий байгууллагаас хориглоогүй технологийг
                  ашигладаг болохыг;
                </li>
                <li className={css.list_item}>
                  Компани нь Харилцагчийн эрх ашгийг холбогдох хууль тогтоомжийн
                  дагуу хамгаална гэдгийг мэдэгдэж, баталж байна.
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Харилцагч нь дараах зүйлүүдийг мэдэгдэж, баталж байгаа бөгөөд
              Компани нь Харилцагчийн энэхүү мэдэгдэл болон баталгааны үндсэн
              дээр үйлчилгээг үзүүлж байгаа болно. Үүнд:
              <ol className={css.list}>
                <li className={css.list_item}>
                  Платформын Танилцуулга болон аппликейшнтэй бүрэн танилцсан
                  болохыг;
                </li>
                <li className={css.list_item}>
                  Энэхүү Үйлчилгээний нөхцөлийг уншиж, танилцсан болохыг;
                </li>
                <li className={css.list_item}>
                  Платформд бүртгүүлсэн өөрийн мэдээллийг үнэн зөв болохыг;
                </li>
                <li className={css.list_item}>
                  “Зөвшөөрч байна” гэсэн товчийг дарснаас үүсэх хууль зүйн болон
                  бусад үр дагаврыг бүрэн ойлгож, зөвшөөрч байгаа болохыг;
                </li>
                <li className={css.list_item}>
                  Доор байрлах “Зөвшөөрч байна” гэсэн товчийг дарснаар энэхүү
                  Үйлчилгээний нөхцөлийг бүрэн хүлээн зөвшөөрсөнд тооцно гэдгийг
                  хүлээн зөвшөөрч байгаа болохыг;
                </li>
                <li className={css.list_item}>
                  Энэхүү үйлчилгээний нөхцөлийг хүлээн зөвшөөрч, эрх эдэлж,
                  үүрэг хариуцлагаа хүлээх эрх зүйн бүрэн чадамжтай болохыг;
                </li>
                <li className={css.list_item}>
                  Платформыг ашиглах явцад хийсэн сонголт, өөрийн хийсэн аливаа
                  үйлдэл, түүнээс үүсэх үр дүнг бүрэн хариуцах болохыг;
                </li>
                <li className={css.list_item}>
                  Компани нь Харилцагчийн мэдээллийн үнэн зөв байдал,
                  үйлчилгээний чанар, Үйлчилгээг авснаас үүсэх үр дүн,
                  Хэрэглэгчийн хийсэн захиалга, захиалгын өөрчлөлт, цуцлалтаас
                  үүсэх үр дүнг хариуцахгүй болохыг;
                </li>
                <li className={css.list_item}>
                  Платформыг бусдыг залилах, хуулан мэхлэх, бусдын нэр төрд
                  халдах, гутаан доромжлох, мөнгө угаах, терроризмыг
                  санхүүжүүлэх болон Монгол Улсын хуулиар хориглосон аливаа гэмт
                  хэргийн зорилгоор ашиглахгүй болохыг;
                </li>
                <li className={css.list_item}>
                  Платформын үйлчилгээг зөвхөн хууль ёсны үйл ажиллагаанд
                  ашиглах болохыг;
                </li>
                <li className={css.list_item}>
                  Харилцагч нь Платформын үйлчилгээний багц болон гуравдагч
                  байгууллагын үйлчилгээний шимтгэлийг дангаар хариуцах болохыг,
                </li>
                <li className={css.list_item}>
                  Компани нь өөрийн Платформоор дамжуулан хүлээн авсан
                  Харилцагчийн мэдээллийг цуглуулах, хадгалах, боловсруулахыг
                  хүлээн зөвшөөрч байгаа болохыг,
                </li>
                <li className={css.list_item}>
                  Харилцагч Платформд бүртгүүлснээр Платформ болон Компани-с
                  илгээсэн цахим мэдээллийг (жишээ нь, имэйл, мэдэгдэл, текст
                  мессеж эсвэл бусад төрлийн мессеж) хүлээн авахыг зөвшөөрч
                  байна. Мөн Харилцагчийн Компанид өгсөн хувийн мэдээлэл,
                  Үйлчилгээг ашиглах явцад цугларсан аливаа мэдээлэлд
                  тулгуурласан хэрэглэгчийн сонирхлыг татаж болох эсвэл нийт
                  хэрэглэгчид санал болгосон сурталчилгааны мэдээллийг хүлээн
                  авахыг хүлээн зөвшөөрч байгаа болохыг Харилцагч нь мэдэгдэж,
                  баталж байна.
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Бүртгэл болон шаардлага</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Бүртгэл
              <ol className={css.list}>
                <li className={css.list_item}>
                  Харилцагчид дараах шаардлага тавигдана. Үүнд:
                  <ol>
                    <li>
                      Харилцагч Платформд сайн дурын үндсэн дээр бүртгэл
                      үүсгэнэ.
                    </li>
                    <li>
                      Харилцагч нь Платформд бүртгэлтэй ангилалд хамаарах
                      үйлчилгээ үзүүлэгч, бизнес эрхлэгч хувь хүн болон хуулийн
                      этгээд байна.
                    </li>
                    <li>
                      Харилцагч нь үйлчилгээг ашиглахаас өмнө Платформын
                      танилцуулга, Нууцлалын бодлого, Гарын авлага, Үйлчилгээний
                      нөхцөлтэй танилцаж зөвшөөрсөн байна.
                    </li>
                  </ol>
                </li>
                <li className={css.list_item}>
                  Платформд дараах 4 төрлөөр Харилцагчийн бүртгэлийн үүсгэнэ.
                  Үүнд:
                  <ol>
                    <li>Хувь харилцагч</li>
                    <li>Байгууллага</li>
                    <li>Салбартай байгууллага</li>
                    <li>Салбар байгууллага</li>
                  </ol>
                </li>
                <li className={css.list_item}>
                  Харилцагч өөрийн өмнөөс, Хуулийн этгээдийг төлөөлөн мөн салбар
                  аж ахуйн нэгжийн өмнөөс бүртгэл үүсгэж болно.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь Хэрэглэгч, хувиараа бизнес эрхлэгч болон Хуулийн
                  этгээдийг төлөөлсөн давхар бүртгэл үүсгэж болно.
                </li>
                <li className={css.list_item}>
                  Харилцагчийн өмнөөс хэн нэгэн өөр этгээд бүртгүүлсэн сэжигтэй
                  тохиолдол илэрвэл Компанид мэдэгдэх, шалгуулах эрхтэй.
                </li>
                <li className={css.list_item}>
                  Харилцагч Платформд бүртгэл үүсгэхийн тулд Овог нэр/Хуулийн
                  этгээдийн нэр, Регистрийн дугаар, цахим шуудангийн хаяг,
                  Утасны дугаар болон бусад шаардлагатай баримт бичгийг илгээнэ.
                </li>
                <li className={css.list_item}>
                  Дээрх мэдээллүүд хэрэв анх бүртгүүлснээс хойш өөрчлөгдсөн
                  тохиолдолд шинэчлэн хадгалах эсхүл Компанид мэдэгдэх;
                </li>
                <li className={css.list_item}>
                  Харилцагч өөрийн мэдээллийг үнэн зөв, бүрэн оруулах, өөрчлөлт
                  орсон тохиолдолд тогтмол шинэчлэх үүрэгтэй ба өөрийн оруулсан
                  мэдээлэл, үйлдэл болон эс үйлдэхүйд хариуцлага хүлээнэ.
                </li>
                <li className={css.list_item}>
                  Харилцагч санаатай болон санамсаргүй буруу ташаа мэдээлэл
                  бүртгүүлэх, Платформын үйлчилгээг бусдыг хууран мэхлэх,
                  залилах, бусдын нэр хүндэд халдах, гутаан доромжлох болон
                  аливаа хууль, дүрэм, энэхүү үйлчилгээний нөхцөл түүнд
                  холбогдох дүрэм, бодлогод харшлах үйлдэл хийсэн бол Компани
                  Харилцагчийн Платформд хандах үйлчилгээний эрхийг хэсэгчлэн
                  болон бүрэн хязгаарлах, бүртгэлийг цуцлан үйлчилгээ үзүүлэхээс
                  татгалзах эрхтэй.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь Платформд хандах эрхийн мэдээллээ хамгаалах,
                  нууцлалыг хадгалах, бусдад задруулахгүй байх үүрэгтэй. Тус
                  үүргийг биелүүлээгүйгээс үүсэх эрсдэлийг Харилцагч өөрөө бүрэн
                  хариуцна.
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Тохиргоо
              <ol className={css.list}>
                <li className={css.list_item}>
                  Харилцагч Платформын үйлчилгээг авахын тулд дараах тохиргоог
                  өөрийн үйл ажиллагаа, дотоод зохион байгуулалт, цагийн
                  хуваарьт уялдуулан хийнэ. Үүнд:
                  <ol>
                    <li>Ажлын газар</li>
                    <li>Цагийн хуваарь</li>
                    <li>Үйлчилгээ</li>
                    <li>Ажилчид</li>
                    <li>Цаг захиалга</li>
                  </ol>
                </li>
                <li className={css.list_item}>
                  Харилцагч 3.2.1-т заасан тохиргоог бүрэн, зөв хийснээр
                  Платформын үйлчилгээг авах боломжтой болно.
                </li>
                <li className={css.list_item}>
                  Тохиргоог буруу, алдаатай хийснээс үүсэх үр дагаврыг Харилцагч
                  бүрэн хариуцна.
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Үйлчилгээ</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Цаг захиалга бүртгэл
              <ol className={css.list}>
                <li className={css.list_item}>
                  Платформд дараах 3 хэлбэрээр цаг захиалгыг бүртгэх боломжтой.
                  Үүнд:
                  <ol>
                    <li>Хэрэглэгчийн хийсэн захиалга</li>
                    <li>Ажилтны апп дээр бүртгэсэн захиалга</li>
                    <li>Харилцагчийн вэб дээр бүртгэсэн захиалга</li>
                  </ol>
                </li>
                <li className={css.list_item}>
                  Харилцагч 4.1.1-т дурдсан хэлбэрээр бүртгэгдсэн бүх
                  захиалгуудыг Харилцагчийн хандах эрхээр Платформд хандан
                  нэгтгэн ашиглана.
                </li>
                <li className={css.list_item}>
                  Хэрэглэгчийн цагийг Утасны дугаараар бүртгэнэ.
                </li>
                <li className={css.list_item}>
                  Харилцагч Платформд бүртгэсэн цаг захиалгыг үйл ажиллагаандаа
                  чанд баримтална. Хэрэв тус цагийг цуцлах бол энэхүү нөхцөлийн
                  Захиалга цуцлах, өөрчлөх бол Захиалга өөрчлөх хэсэгт заасан
                  нөхцөлийг баримтална.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь захиалгад холбогдох асуудлаар Хэрэглэгчийн
                  бүртгэлтэй утасны дугаараар холбогдож болно.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь Хэрэглэгчийн цаг захиалгыг урьдчилгаа төлбөрөөр
                  баталгаажуулж болно.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь өөрийн үзүүлсэн үйлчилгээний чанар, үр дүнг
                  дангаар хариуцах ба Компаниас ангид байлгана.
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Захиалга цуцлах
              <ol className={css.list}>
                <li className={css.list_item}>
                  Хэрэглэгч нь хүссэн үедээ захиалгыг цуцлах боломжтой.
                </li>
                <li className={css.list_item}>
                  Урьдчилгаа төлбөрөөр баталгаажуулсан цаг захиалгыг
                  хэрэглэгчийн хүсэлтээр цуцалсан бол Харилцагч урьдчилгаа
                  төлбөрийг буцаан өгөх үүрэг хүлээхгүй.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь Хэрэглэгчийн хүсэлтээс гадуур дур мэдэн захиалгыг
                  цуцлахгүй байх үүрэгтэй. Зөвхөн цаг захиалсан Хэрэглэгч өөрөө
                  цуцалсан, цуцлахыг хүссэн эсвэл цуцлах зөвшөөрөл өгсөн
                  тохиолдолд цуцалж болно.
                </li>
                <li className={css.list_item}>
                  Хэрэглэгчийн хүсэлтээр/зөвшөөрлөөр захиалгыг цуцлах тохиолдолд
                  Захиалгын тэмдэглэл хэсэгт тэмдэглэл хийж цуцлалт хийнэ.
                </li>
                <li className={css.list_item}>
                  Харилцагч хэрэглэгчийн хүсэлтээс гадуур захиалгыг цуцалсны
                  улмаас үүссэн аливаа маргаан, хохирлыг Компани хариуцахгүй
                  бөгөөд Харилцагч өөрөө бүрэн хариуцна.
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Захиалга өөрчлөх
              <ol className={css.list}>
                <li className={css.list_item}>
                  Захиалгыг өөрчлөх боломжит хугацааг Харилцагч өөрөө
                  тохируулна.
                </li>
                <li className={css.list_item}>
                  Захиалгын цагаа өөрчлөх боломжит хугацаанд Хэрэглэгч нь
                  захиалгын цагийг өөрчлөх боломжтой байна.
                </li>
                <li className={css.list_item}>
                  Захиалгын цагаа өөрчлөх боломжтой хугацаа хэтэрсэн тохиолдолд
                  Хэрэглэгч нь захиалгын цагийг өөрчлөх боломжгүй байна.
                </li>
                <li className={css.list_item}>
                  Урьдчилгаа төлбөрөөр баталгаажуулсан цаг захиалгыг өөрчлөхөд
                  Хэрэглэгч дахин урьдчилгаа төлбөр төлөх шаардлагагүй.
                </li>
                <li className={css.list_item}>
                  Цаг захиалсан Хэрэглэгч өөрөө захиалгыг өөрчлөхийг хүссэн,
                  эсвэл өөрчлөх зөвшөөрөл өгсөн тохиолдолд захиалгыг өөрчилж
                  болно.
                </li>
                <li className={css.list_item}>
                  Хэрэглэгчийн хүсэлтээс гадуур захиалгыг өөрчилсний улмаас
                  үүссэн аливаа маргаан, хохирлыг Компани хариуцахгүй бөгөөд
                  Харилцагч өөрөө бүрэн хариуцна.
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Урьдчилгаа төлбөр
              <ol className={css.list}>
                <li className={css.list_item}>
                  Харилцагч Платформоор дамжуулсан цаг захиалгыг урьдчилгаа
                  төлбөрөөр баталгаажуулах эсэхийг мөн урьдчилгаа төлбөрийн дүнг
                  тохируулна.
                </li>
                <li className={css.list_item}>
                  Харилцагч урьдчилгаа төлбөр авахаар тохируулбал Харилцагчийн
                  Платформд бүртгэсэн бүх үйлчилгээний цаг захиалгыг урьдчилгаа
                  төлбөрөөр баталгаажуулна. Тухайлсан нэг үйлчилгээнд урьдчилгаа
                  төлбөр авахаар Платформд тохируулах боломжгүй.
                </li>
                <li className={css.list_item}>
                  Харилцагч урьдчилгаа төлбөрөөр баталгаажсан цаг захиалгын
                  дагуу үйлчилгээ үзүүлсний дараа үйлчилгээний нийт төлбөрөөс
                  урьдчилгаа төлбөрийн дүнг хасаж Хэрэглэгчээс нэхэмжилнэ.
                </li>
                <li className={css.list_item}>
                  Платформоор дамжуулан хийгдэж буй урьдчилгаа төлбөр,
                  үйлчилгээний төлбөрийн гүйлгээг Кю-Пэй 2.0 үйлчилгээгээр
                  хийгдэнэ.
                </li>
                <li className={css.list_item}>
                  Кю-Пэй 2.0 үйлчилгээг ашигласан шилжүүлгийн мэдээлэл (дансны
                  дугаар, гүйлгээний мэдээлэл, QR код гэх мэт.)-ийг Компани нь
                  зөвхөн дамжуулах ба гүйлгээ Хэрэглэгч болон Харилцагчийн данс
                  хооронд Компанийн дансаар дамжуулахгүй шууд хийгдэнэ.
                </li>
                <li className={css.list_item}>
                  Кю-Пэй 2.0 үйлчилгээний шимтгэл хүлээн авсан гүйлгээ тутмын
                  1.0%-тай тэнцэх мөнгөн дүн байна.
                </li>

                <li className={css.list_item}>
                  Харилцагчийн өөрийн бүртгүүлсэн банкны дансанд хүлээн авна.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь Платформын үйлчилгээг ашиглан урьдчилгаа төлбөр,
                  үйлчилгээний төлбөрийг хүлээн авсныг ККТТ ХК-ын Кю-Пэй 2.0
                  үйлчилгээг ашиглах, энэ Үйлчилгээний нөхцөлийн 4.4.6-д заасан
                  үйлчилгээний шимтгэлийг төлөхийг зөвшөөрсөн гэж үзнэ.
                </li>
                <li className={css.list_item}>
                  Энэ Үйлчилгээний нөхцөлийн <b>Үйлчилгээний багц</b> хэсэгт
                  заасан Багцын төлбөрт ККТТ ХК-ын Кю-Пэй 2.0 үйлчилгээний
                  шимтгэл хамаарахгүй бөгөөд Харилцагч Багцын төлбөрийг төлсөн
                  нь Кю-Пэй 2.0 үйлчилгээний шимтгэлээс чөлөөлөх, хөнгөлөх
                  үндэслэл болохгүй.
                </li>
                <li className={css.list_item}>
                  Харилцагч банкны нэр, дансны нэр, дугаарыг зөрүүтэй, алдаатай
                  бүртгүүлснээс шалтгаалж үүссэн асуудал (шилжүүлэг хийгдэхгүй
                  байх, шилжүүлэг хийгдээгүйгээс хэрэглэгч цаг захиалгаа
                  баталгаажуулж чадахгүй байх, шилжүүлэг буруу хийгдэх)-ыг
                  Харилцагч бүрэн хариуцна.
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Платформоор үйлчилгээний төлбөр хүлээн авах
              <ol className={css.list}>
                <li className={css.list_item}>
                  Харилцагч өөрийн бүртгүүлсэн үйлчилгээний үнийн үнэн бодит
                  байдал, үйлчилгээний чанар, үйлчилгээ авсны дараах үр дүнг
                  Харилцагч бүрэн хариуцна. Үйлчилгээ авсны дараах бодит үр дүн,
                  хэрэглэгчийн сэтгэл ханамж болон үнийн дүнгийн зөрүүнээс болж
                  үүссэн аливаа маргаан, хохирлыг Компани хариуцахгүй
                </li>
                <li className={css.list_item}>
                  Харилцагч нь үйлчилгээний төлбөрийг дараах хэлбэрээр хүлээн
                  авах боломжтой. Үүнд:
                  <ol>
                    <li>
                      Платформоор дамжуулан Кю-Пэй 2.0 үйлчилгээг ашиглах,
                    </li>
                    <li>
                      Харилцагч өөрийн ашигладаг бусад төлбөрийн хэрэгслийг
                      ашиглан үйлчилгээний төлбөрийг Хэрэглэгчээс хүлээн авна.
                    </li>
                  </ol>
                </li>
                <li className={css.list_item}>
                  Харилцагч дараах алхмаар Платформоор дамжуулан үйлчилгээний
                  төлбөр хүлээн авна. Үүнд:
                  <ol>
                    <li>
                      Хэрэглэгчид үйлчилгээг үзүүлсний дараа Захиалгын дэлгэцээс
                      тухайн Захиалгын дэлгэрэнгүй” рүү орно.
                    </li>
                    <li>
                      Төлбөрийн дэлгэрэнгүй хэсэгт хэрэглэгчийн авсан үйлчилгээ,
                      түүний төлбөрийн мэдээллийг шалгана. Хэрэв хэрэглэгч
                      нэмэлт үйлчилгээ авсан бол төлбөрийн мэдээллийг “Төлбөр
                      засах” товчлуур дээр дарж засаад Хадгалах боломжтой.
                    </li>
                    <li>Төлбөрийн төрлийг сонгоно.</li>
                    <li>
                      Гарч ирсэн QR кодыг Хэрэглэгч утсан дээрх банкны апп-аар
                      уншуулах эсвэл өөрийн Платформоос төлбөр төлөх сонголтыг
                      хийн банкны апп-аар уншуулан төлбөр төлөх боломжтой.
                    </li>
                    <li>
                      Кю-пэй 2.0 үйлчилгээ ашиглан үйлчилгээний төлбөр хүлээн
                      авахад 1.0%-ийн шимтгэл хасагдсан дүнгээр Платформд
                      бүртгэлтэй өөрийн банкны дансанд төлбөрийг хүлээн авна.
                    </li>
                    <li>
                      Төлбөр төлөгдсөн эсэхийг Гүйлгээний тайлан цэсээс шалгах
                      боломжтой.
                    </li>
                  </ol>
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Компанийн эрх, үүрэг</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Компани нь дараах эрхтэй байна. Үүнд:
              <ol className={css.list}>
                <li className={css.list_item}>
                  Компани нь өөрийн Платформын үйлчилгээ, ашиглаж буй технологид
                  аливаа технологийн шинэчлэлт хийх, өөрчлөх, дуусгавар болгох
                  эрхтэй байна.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь энэхүү Үйлчилгээний нөхцөлийн 2.2-р зүйлд заасан
                  зүйлийг зөрчсөн, биелүүлээгүй эсхүл биелүүлэх боломжгүй болсон
                  гэж үзсэн тохиолдолд тухайн Харилцагчийн Үйлчилгээ авах эрх
                  болон хаягийг нь хязгаарлах эсхүл хаах хүртэл арга хэмжээг
                  авах эрхтэй байна.
                </li>
                <li className={css.list_item}>
                  Харилцагч нь бусдыг залилан мэхлэх, хуурах, бусдын нэр төрд
                  халдах, гутаан доромжлох болон хуульд харшлах аливаа үйлдэлд
                  Платформыг ашигласан, ашиглах сэдэлтэй байж болзошгүй нөхцөл
                  байдал үүссэн тохиолдолд тухайн Харилцагчийн авсан багцын
                  үйлчилгээний хугацаа дууссан эсэхээс үл хамааран үйлчилгээний
                  эрхийг хэсэгчлэн эсхүл бүрэн хаах, дээрх асуудлаар холбогдох
                  эрх бүхий байгууллагад хандах,
                </li>
                <li className={css.list_item}>
                  Харилцагчид үйлчилгээ үзүүлэх явцад олж авсан Харилцагч түүний
                  Хэрэглэгчдийн мэдээллийг Нууцлалын бодлогын дагуу цуглуулах,
                  хадгалах, боловсруулах, ашиглах,
                </li>
                <li className={css.list_item}>
                  Платформын багцууд, тэдгээрийн үнийг өөрчлөх, хөнгөлөлт
                  урамшуулалт зарлах, цуцлах,
                </li>
                <li className={css.list_item}>
                  Платформын шинэчлэлт өөрчлөлтөөс шалтгаалан Харилцагч,
                  Хэрэглэгчдэд урьдчилан мэдэгдсэний үндсэн дээр Платформын
                  хэвийн үйл ажиллагааг түр хугацаанд хэсэгчлэн болон бүрэн
                  зогcоох;
                </li>
                <li className={css.list_item}>
                  Монгол Улсын эрх бүхий байгууллагаас аливаа харилцагчийн
                  мэдээллийг зохих хуулийн үндсэн дээр шаардсан тохиолдолд
                  тухайн харилцагчийн мэдээллийг гаргаж өгөх,
                </li>
                <li className={css.list_item}>
                  Харилцагчаас энэхүү Үйлчилгээний нөхцөлд заасан зохих үүргээ
                  биелүүлэхийг шаардах эрхтэй байна.
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Компани нь дараах үүрэг хүлээнэ. Үүнд:
              <ol className={css.list}>
                <li className={css.list_item}>
                  Харилцагчдад сонгосон багцын үйлчилгээг алдаагүй найдвартай
                  хүргэх,
                </li>
                <li className={css.list_item}>
                  Энэхүү Үйлчилгээний нөхцөлийн 2.1-р зүйлд заасан Мэдэгдэл
                  болон баталгааны үнэн зөв байдлыг хариуцах,
                </li>
                <li className={css.list_item}>
                  Харилцагчийн мэдээллийн аюулгүй байдлыг холбогдох хуулийн
                  дагуу хамгаалах,
                </li>
                <li className={css.list_item}>
                  Харилцагчийн үүсгэсэн, дамжуулсан хувийн болон санхүүгийн
                  мэдээллийг энэхүү үйлчилгээний нөхцөлд зааснаас бусад
                  зорилгоор ашиглах, бусдад задруулахгүй байх бөгөөд мэдээллийн
                  нууцлалыг Компанийн нууцлалын бодлого болон холбогдох хуулийн
                  дагуу хамгаалах,
                </li>
                <li className={css.list_item}>
                  Өөрийн Платформын үйлчилгээ, ашиглаж буй технологийг шинэчлэх,
                  өөрчлөх, дуусгавар болгох талаар шаардлагатай мэдээллийг
                  Харилцагчид мэдэгдэх үүрэгтэй.
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Харилцагчийн эрх үүрэг</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Харилцагч дараах эрхтэй байна. Үүнд:
              <ol className={css.list}>
                <li className={css.list_item}>
                  Харилцагч нь өөрийн хэрэгцээ, шаардлага, бүтэц зохион
                  байгуулалт, үйл ажиллагаанд тохируулан Платформын үйлчилгээний
                  багцыг сонгон идэвхжүүлэх,
                </li>
                <li className={css.list_item}>
                  Идэвхжүүлсэн багцын үйлчилгээг багцын идэвхтэй хугацаанд
                  Үйлчилгээний нөхцөлийн дагуу ашиглах,
                </li>
                <li className={css.list_item}>
                  Компанийг энэхүү Үйлчилгээний нөхцөлд заасан зохих үүргээ
                  биелүүлэхийг шаардах,
                </li>
                <li className={css.list_item}>
                  Сонгосон үйлчилгээний багцыг хүссэн үедээ ахиулах, одоогийн
                  авсан багцыг багцын үйлчилгээний идэвхтэй хугацаа дууссаны
                  дараа бууруулах,
                </li>
                <li className={css.list_item}>
                  Компаниас Платформын ажиллагаа, ашиглалттай холбогдох сургалт
                  (Нэг удаагийн онлайн сургалт), заавар, дэмжлэгийг авах;
                </li>
                <li className={css.list_item}>
                  Платформоор дамжуулан Кю-Пэй үйлчилгээг ашиглан өөрийн
                  үйлчилгээнд захиалга авахдаа урьдчилгаа төлбөр, үйлчилгээг
                  үзүүлсний дараа үйлчилгээний төлбөрийг Платформоор дамжуулан
                  хүлээн авах болон эс авах байдлаар тохируулах,
                </li>
                <li className={css.list_item}>
                  Өөрийн үйлчилгээний нэр төрөл, үйлчилгээний үнийн дүн,
                  урьдчилгаа төлбөрийг тохируулах, өөрчлөх эрхтэй.
                </li>
              </ol>
            </li>

            <li className={css.list_item}>
              Харилцагч нь дараах үүрэг хүлээнэ. Үүнд:
              <ol className={css.list}>
                <li className={css.list_item}>
                  Платформыг ашиглахдаа Платформын Үйлчилгээний нөхцөл,
                  ашиглалтын заавар дүрмийг мөрдөх,
                </li>
                <li className={css.list_item}>
                  Платформд өөрийн үйл ажиллагааны төрөл, үйлчилгээ, дансны
                  мэдээлэл, үйлчилгээний үнэ, ажилтнуудын мэдээлэл, тэдгээрийн
                  ажлын цагийн хуваарийн мэдээллийг үнэн зөв бүртгэх, хэрэв
                  өөрчлөгдсөн тохиолдолд тухай бүрд шинэчлэх,
                </li>
                <li className={css.list_item}>
                  Харилцагч нь 3.2.1-т заасан өөрийн бүртгэлд холбогдох
                  тохиргоог үнэн зөв, бүрэн хийх, өөрчлөлт шинэчлэлтийг тухай
                  бүр бүртгэх, тохируулах,
                </li>
                <li className={css.list_item}>
                  Харилцагч нь энэхүү Үйлчилгээний нөхцөлийн 2.2-р зүйлд заасан
                  Мэдэгдэл болон баталгааныхаа үнэн зөв байдлыг хариуцах болон
                  хадгалах,
                </li>
                <li className={css.list_item}>
                  Өөрийн Бүртгэлд сэжигтэй тохиолдолд илэрсэн тохиолдолд
                  Компанид нэн даруй мэдэгдэх,
                </li>
                <li className={css.list_item}>
                  Бусад этгээдэд өөрийн Харилцагчийн бүртгэлийг хуульд
                  хориглосон эсхүл зөвшөөрсөн байдлаар, эсхүл хуульд заагаагүй
                  бусад аргаар бусдад шилжүүлэх, ашиглуулах болон бусад аргаар
                  аливаа этгээдийн мэдэлд шилжүүлэхгүй байх,
                </li>
                <li className={css.list_item}>
                  Өөрийн Харилцагчийн бүртгэл, нэвтрэх мэдээлэл, Платформоос
                  илгээгддэг нэг удаагийн баталгаажуулах кодын нууцлал, аюулгүй
                  байдлыг хамгаалах аюулгүй ажиллагааг хангах,
                </li>
                <li className={css.list_item}>
                  Энэхүү Үйлчилгээний нөхцөлд заасан үүргээ биелүүлээгүйгээс
                  үүсэх хохирол, эрсдэлийг дангаар хариуцна.
                </li>
                <li className={css.list_item}>
                  Өөрийн болон өөрт хамааралтай этгээд (ажилтан)-үүдийн
                  бүртгэлийн мэдээллүүдийн үнэн зөв байдал, үйлчилгээний үр дүнг
                  бүрэн хариуцах бөгөөд Платформд бүртгэсэн цаг захиалгын
                  хуваарийг чанд мөрдөн ажиллах,
                </li>
                <li className={css.list_item}>
                  Хэрэглэгчийн цаг захиалгын хугацаа, үйлчилгээ үзүүлэх ажилтныг
                  дангаар дур мэдэн өөрчлөх, цуцлахгүй байх, шаардлагатай
                  тохиолдолд Цаг захиалсан хэрэглэгчтэй зөвшилцөх замаар
                  шийдвэрлэх,
                </li>
                <li className={css.list_item}>
                  Хэрэв энэ үйлчилгээний нөхцөлийн 3.2.2, 4.2.3, 4.3.5, 4.4.10,
                  4.5.1-т заасан нөхцөл зөрчигдсөнөөс Талууд болон гуравдагч
                  этгээдэд учирсан аливаа хохирлыг бүрэн хариуцах;
                </li>
                <li className={css.list_item}>
                  Платформоор дамжуулан Кю-Пэй 2.0 үйлчилгээгээр урьдчилгаа
                  болон үйлчилгээний төлбөрийг авах тохиолдолд Кю-Пэй 2.0
                  үйлчилгээний шимтгэлийг дангаар бүрэн хариуцах,
                </li>
                <li className={css.list_item}>
                  Өөрийн үйл ажиллагаа, үйлчилгээнд холбогдох татвар, суутгал,
                  шимтгэлийг бүрэн хариуцах үүрэгтэй.
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Үйлчилгээний багц</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Үйлчилгээний багцын үйлчилгээ, түүний төлбөрийг Компани
              тодорхойлох ба тэдгээрт өөрчлөлт хийх эрхтэй. Мөн Компани нь
              ялгаатай Харилцагчдад ялгаатай байдлаар үйлчилгээ санал болгож,
              үнэ тогтоож болно.
            </li>
            <li className={css.list_item}>
              Компани Үйлчилгээний багцын мэдээллийг өөрчилсөн тохиолдолд
              вэбсайтад тэр даруй нийтлэх болно.
            </li>
            <li className={css.list_item}>
              Харилцагч багцын төлбөрийг төлснөөр Харилцагчийн сонгосон
              хугацаагаар багц идэвхэжнэ.
            </li>
            <li className={css.list_item}>
              Харилцагч хүссэн үедээ Багц ахиулах боломжтой байна. Хэрэв
              идэвхтэй багцын хугацаа дуусахаас өмнө багц ахиулбал тухайн өдрөөр
              тасалбар болгон, зөрүү төлбөрийг Харилцагч төлснөөр Багц ахиулна.
            </li>
            <li className={css.list_item}>
              Харилцагч идэвхтэй багцын хугацаа дууссаны дараа Багц бууруулах
              боломжтой.
            </li>
            <li className={css.list_item}>
              Харилцагч багцын үйлчилгээг нэгэнт идэвхжүүлсэн тохиолдолд
              үйлдлийг буцаах, цуцлах боломжгүй ба Компани төлбөрийг буцаан
              олгохгүй. Мөн Харилцагч идэвхжүүлсэн багцын үйлчилгээг ашиглаагүй,
              цаг захиалга бүртгээгүй, Хэрэглэгч цаг захиалаагүй зэрэг нь төлбөр
              буцаан олгох, багцын хугацааг улируулан ашиглах нөхцөл болохгүй.
            </li>
            <li className={css.list_item}>
              Багцын хугацааг хуанлийн хоногоор тооцно.
            </li>
            <li className={css.list_item}>
              Багцын дуусах хугацааг багцын сүүлийн хоногийн 23:59:59 цагаар
              тасалбар болгоно.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Мэдээллийн нууцлал</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Компани нь Монгол Улсын холбогдох хууль, Компанийн Нууцлалын
              бодлогын дагуу Хэрэглэгчийн нууцыг хадгална.
            </li>
            <li className={css.list_item}>
              Интернэтэд суурилсан сүлжээгээр дамжуулсан (цахим хаяг, олон
              нийтийн цахим платформ) мэдээлэл нь аюулгүй байж чадахгүй бөгөөд
              дамжуулах явцад алдагдсан тохиолдолд Компани хариуцлага хүлээхгүй.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Харилцагчид хориглох зүйлс</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Харилцагч дараах мэдээллүүдийг нийтлэх, хавсаргах, дамжуулахыг
              хориглоно.
              <ol className={css.list}>
                <li className={css.list_item}>
                  Бусдыг дарамталсан, бусдыг гутаан доромжилсон, гүтгэсэн,
                  хувийн нууцад халдсан, үзэн ядсан, ялгаварлан гадуурхсан,
                  мөнгө угаах болон садар самуун сурталчилсан, түүнд уруу татсан
                  гэх мэт хууль бус мэдээлэл,
                </li>
                <li className={css.list_item}>
                  Насанд хүрээгүй хүүхдэд хохирол учруулахуйц мэдээлэл,
                </li>
                <li className={css.list_item}>
                  Патент, барааны тэмдэгт, зохиогчийн эрх болон бусад өмчийн
                  эрхийг зөрчсөн,
                </li>
                <li className={css.list_item}>
                  Монгол улсад мөрдөгдөж буй аливаа хууль дүрэм, журмыг зөрчсөн,
                </li>
                <li className={css.list_item}>Хууран мэхлэх, залилах,</li>
                <li className={css.list_item}>
                  Компьютер, программ хангамжийн үйл ажиллагааг тасалдуулах,
                  устгах эвдэх хэмжээний вирус, код, файл, программ агуулсан
                  файл мэдээ мэдээлэл нийтлэх, нийтлэхийг оролдох,
                </li>
              </ol>
            </li>
            <li className={css.list_item}>
              Харилцагчдад дараах үйлдлүүдийг хориглоно.
              <ol className={css.list}>
                <li className={css.list_item}>
                  Мэдээллийн бүрэн бүтэн, аюулгүй байдлыг зөрчих болон зөрчихийг
                  оролдох,
                </li>
                <li className={css.list_item}>
                  Дутуу, худал мэдээлэл санаатайгаар оруулах,
                </li>
                <li className={css.list_item}>
                  Платформын аль нэг хэсгийн кодыг тайлах, кодлохыг оролдох,
                </li>
                <li className={css.list_item}>
                  Платформын мэдээллийг хэсэгчлэн авч эвлүүлэг хийх, буруу
                  зорилгоор ашиглах, буруутгах, зураг линктэй холбох,
                </li>
                <li className={css.list_item}>
                  Программ хангамжийн эрхийн удирдлага, аюулгүй байдалд
                  заналхийлэх,
                </li>
              </ol>
            </li>
            <li className={css.list_item}>
              Компани нь дээр дурдсан мэдээллүүдийн талаар мэдээлэл авч
              баталгаажуулсны дараа уг мэдээллүүдийг устгах эрхтэй. Мөн уг
              мэдээллүүдийг Шүүх хяналтын байгууллагад шилжүүлтэл эд мөрийн
              баримтаар хадгалах эрхтэй.
            </li>
            <li className={css.list_item}>
              Хэрэглэгч веб хуудсыг ашиглах, үзэх, эсвэл веб хуудаснаас аливаа
              материал, өгөгдөл, текст, зураг, видео контент, аудио агуулгыг
              татаж авах үед Хэрэглэгчийн нэвтрэх эрхээр тоног төхөөрөмжид
              халдаж болзошгүй аливаа гэмтэл, вирус зэрэгт Компани нь хариуцлага
              хүлээхгүй.
            </li>
            <li className={css.list_item}>
              Компани нь холбогдох хууль, дүрэм журам болон Энэхүү Үйлчилгээний
              нөхцөлийг зөрчсөн Хэрэглэгчийг бүртгэлээс хасаж, ашиглах эрхийг
              нэн даруй дуусгавар болгох эрхтэй.
            </li>
            <li className={css.list_item}>
              Компани нь Оюуны өмчийн эрхийг зөрчсөн ямар ч тохиолдолд
              хариуцлага хүлээхгүй.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Дуусгавар болох</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Харилцагч болон Компани хооронд үүсэх аливаа харилцааг Монгол
              улсын холбогдох хүчин төгөлдөр хууль, дүрэм, журмаар зохицуулна.
            </li>
            <li className={css.list_item}>
              Компани нь дараах тохиолдлуудад Хэрэглэгчийн Платформд нэвтрэх
              эрхийг мэдэгдэх эсвэл мэдэгдэлгүйгээр хууль тогтоомжийн дагуу
              түдгэлзүүлэх, дуусгавар болгох эрхтэй.
              <ol className={css.list}>
                <li className={css.list_item}>
                  Харилцагч нь аливаа хууль бус үйл ажиллагаа явуулсан нь
                  нотлогдсон буюу илэрсэн тохиолдолд,
                </li>
                <li className={css.list_item}>
                  Компанийн зүгээс Харилцагчийн Платформд хандах эрхийг цуцлах
                  бусад үндэслэл тогтоогдсон;
                </li>
                <li className={css.list_item}>
                  Үйлчилгээний нөхцөлд нэмэлт, өөрчлөлт ороход Харилцагч тухайн
                  нэмэлт өөрчлөлтийг зөвшөөрөхгүй үндэслэлээр Харилцагчийн
                  бүртгэлээ цуцлах хүсэлт гаргасан;
                </li>
                <li className={css.list_item}>
                  Үйлчилгээний Нөхцөлд хориглосон хориглолтыг зөрчсөн, хүлээсэн
                  үүргийг биелүүлээгүй болох нь тогтоогдсон бол Харилцагчийн
                  Платформд хандах эрхийг түр эсхүл бүрмөсөн хязгаарлана.
                </li>
              </ol>
            </li>
            <li className={css.list_item}>
              Харилцагчийн хүсэлтээр түүний бүртгэлийг цуцалж болно. Харилцагч
              Компанийн info@timex.mn цахим шуудангийн хаягт Компанийн таньж
              мэдэх (KYC) дүрмийн дагуу Харилцагчийн бүртгэл цуцлах хүсэлт
              ирүүлсэн тохиолдолд Компани бүртгэлийг цуцална. Энэ тохиолдолд
              дараах нөхцөл тавигдана. Үүнд:
              <ol>
                <li>
                  Харилцагчийн бүртгэлд идэвхтэй цаг захиалгагүй байна. Идэвхтэй
                  цаг захиалга байгаа тохиолдолд Хэрэглэгч өөрийн хүсэлтээр
                  цуцласны дараа Харилцагчийн бүртгэлийг цуцална.
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Давагдашгүй хүчин зүйл</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Гэнэтийн буюу Давагдашгүй хүчин зүйл гэдэг нь Компанийн хяналтаас
              гадуур буюу урьдчилан тооцоолох эсхүл таамаглах боломжгүй, энэхүү
              Үйлчилгээний нөхцөлд дурдсан үйлчилгээг үзүүлэх боломжгүй болох
              нөхцөл байдлыг ойлгоно. Үүнд дараах зүйлүүд орох боловч зөвхөн
              үүгээр хязгаарлагдахгүй болно: газар хөдлөлт, хүчтэй салхи, түймэр
              аянга, үер, ган зэрэг байгалийн гамшиг, цацраг идэвхт бодисын
              хордуулалт, олон улсын шинжтэй хил боомт хаагдах (аль нэг талдаа),
              хяналтаас гадуур интернэтийн хязгаарлалт, хөдөлмөрийн маргаанаас
              үүдсэн өргөн хэмжээний эмх замбараагүй байдал, ажил хаялт, аж
              үйлдвэрийн бусад үйл явдал, тахал, дайн, дайн бүхий байдал, хорио
              цээр, газрын агентлагуудын бусад арга хэмжээ болон нийгмийн онцгой
              байдал зэрэг хамаарна.
            </li>
            <li className={css.list_item}>
              Дээр дурдсан 11.1-р зүйл заасан нөхцөл байдал үүссэний улмаас
              Компани үйлчилгээг үзүүлээгүй эсхүл тасалдуулсан тохиолдолд зохих
              хариуцлагаас чөлөөлөгдөх бөгөөд холбогдох үүргийг хүлээхгүй болно.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Бусад</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Үйлчилгээний нөхцөлийн дээд хэсэгт байрлах огноо нь хамгийн сүүлд
              хэзээ шинэчлэгдсэнийг харуулна.
            </li>
            <li className={css.list_item}>
              Үйлчилгээний нөхцөлд оруулсан аливаа өөрчлөлт нь шинэчилсэн
              Үйлчилгээний нөхцөлийг нийтлэх үед хүчин төгөлдөр болно.
            </li>
            <li className={css.list_item}>
              Үйлчилгээний нөхцөлд нэмэлт, өөрчлөлт орсны дараа Үйлчилгээг
              үргэлжлүүлэн ашигласнаар Харилцагч шинэчлэгдсэн Үйлчилгээний
              нөхцөлийг уншиж, ойлгосон болохоо хүлээн зөвшөөрч байна гэж үзнэ.
            </li>
          </ol>
        </li>

        <li className={`${css.list_item} ${css.mainItem}`}>
          <b className={css.mainItem_title}>Холбоо барих</b>

          <ol className={css.list}>
            <li className={css.list_item}>
              Компани Харилцагчтай дараах зорилгоор утас, имэйл, мессеж эсвэл
              бусад харилцаа холбооны цахим хэрэгслээр холбоо барьж болно
              гэдгийг хүлээн зөвшөөрч байна.
              <ol>
                <li>Үйлчилгээтэй холбоотой санал хүсэлт авах,</li>
                <li>
                  Платформд байршсан мэдээлэлтэй холбоотой тодруулга авах,
                </li>
                <li>Платформын үйл ажиллагааг сайжруулах зорилгоор,</li>
              </ol>
            </li>
            <li className={css.list_item}>
              Харилцагч та Платформын талаарх илүү дэлгэрэнгүй мэдээллийг албан
              ёсны цахим хуудас www.timex.mn цахим хуудас болон аппликейшнээс
              авна уу. Мөн Танд Үйлчилгээний нөхцөлтэй холбоотой тодруулах зүйлс
              байвал Компанийн info@timex.mn цахим шуудангаар хандана уу.
            </li>
          </ol>
        </li>
      </ol>
    </div>
  );
};

export default TermsContent;
